###############################################################
#  Generated by:      Cadence Innovus 25.11-s102_1
#  OS:                Linux x86_64(Host ID ip-10-70-171-74.il-central-1.compute.internal)
#  Generated on:      Tue Jan 27 20:47:17 2026
#  Design:            lp_riscv_top
#  Command:           write_db /project/tsmc65/users/schiffe/ws/DVD/hw6/workspace/../dbs/post_route_opt/ -verilog
###############################################################
current_design lp_riscv_top
set_units -time 1ns -capacitance 1pf
create_clock [get_ports {PAD_CLK}]  -name clk -period 7.500000 -waveform {0.000000 3.750000}
#END OF CLOCK SECTION#
set_load -pin_load -max  2.783  [get_ports {PAD_DONE_FLAG}]
set_load -pin_load -min  2.783  [get_ports {PAD_DONE_FLAG}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -min [get_ports {PAD_TEST_EN}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -min [get_ports {PAD_TEST_EN}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -max [get_ports {PAD_TEST_EN}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -max [get_ports {PAD_TEST_EN}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -min [get_ports {PAD_RST_N}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -min [get_ports {PAD_RST_N}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -max [get_ports {PAD_RST_N}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -max [get_ports {PAD_RST_N}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -min [get_ports {PAD_IRAM_PROG_WR}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -min [get_ports {PAD_IRAM_PROG_WR}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -max [get_ports {PAD_IRAM_PROG_WR}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -max [get_ports {PAD_IRAM_PROG_WR}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -min [get_ports {PAD_IRAM_PROG_DATA_BYTE}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -min [get_ports {PAD_IRAM_PROG_DATA_BYTE}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -max [get_ports {PAD_IRAM_PROG_DATA_BYTE}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -max [get_ports {PAD_IRAM_PROG_DATA_BYTE}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -min [get_ports {PAD_IRAM_PROG_BYTE_IDX_1}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -min [get_ports {PAD_IRAM_PROG_BYTE_IDX_1}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -max [get_ports {PAD_IRAM_PROG_BYTE_IDX_1}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -max [get_ports {PAD_IRAM_PROG_BYTE_IDX_1}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -min [get_ports {PAD_IRAM_PROG_BYTE_IDX_0}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -min [get_ports {PAD_IRAM_PROG_BYTE_IDX_0}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -max [get_ports {PAD_IRAM_PROG_BYTE_IDX_0}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -max [get_ports {PAD_IRAM_PROG_BYTE_IDX_0}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -min [get_ports {PAD_IRAM_PROG_BYTE_7}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -min [get_ports {PAD_IRAM_PROG_BYTE_7}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -max [get_ports {PAD_IRAM_PROG_BYTE_7}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -max [get_ports {PAD_IRAM_PROG_BYTE_7}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -min [get_ports {PAD_IRAM_PROG_BYTE_6}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -min [get_ports {PAD_IRAM_PROG_BYTE_6}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -max [get_ports {PAD_IRAM_PROG_BYTE_6}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -max [get_ports {PAD_IRAM_PROG_BYTE_6}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -min [get_ports {PAD_IRAM_PROG_BYTE_5}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -min [get_ports {PAD_IRAM_PROG_BYTE_5}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -max [get_ports {PAD_IRAM_PROG_BYTE_5}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -max [get_ports {PAD_IRAM_PROG_BYTE_5}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -min [get_ports {PAD_IRAM_PROG_BYTE_4}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -min [get_ports {PAD_IRAM_PROG_BYTE_4}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -max [get_ports {PAD_IRAM_PROG_BYTE_4}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -max [get_ports {PAD_IRAM_PROG_BYTE_4}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -min [get_ports {PAD_IRAM_PROG_BYTE_3}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -min [get_ports {PAD_IRAM_PROG_BYTE_3}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -max [get_ports {PAD_IRAM_PROG_BYTE_3}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -max [get_ports {PAD_IRAM_PROG_BYTE_3}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -min [get_ports {PAD_IRAM_PROG_BYTE_2}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -min [get_ports {PAD_IRAM_PROG_BYTE_2}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -max [get_ports {PAD_IRAM_PROG_BYTE_2}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -max [get_ports {PAD_IRAM_PROG_BYTE_2}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -min [get_ports {PAD_IRAM_PROG_BYTE_1}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -min [get_ports {PAD_IRAM_PROG_BYTE_1}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -max [get_ports {PAD_IRAM_PROG_BYTE_1}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -max [get_ports {PAD_IRAM_PROG_BYTE_1}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -min [get_ports {PAD_IRAM_PROG_BYTE_0}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -min [get_ports {PAD_IRAM_PROG_BYTE_0}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -max [get_ports {PAD_IRAM_PROG_BYTE_0}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -max [get_ports {PAD_IRAM_PROG_BYTE_0}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -min [get_ports {PAD_IRAM_PROG_ADDR_BYTE}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -min [get_ports {PAD_IRAM_PROG_ADDR_BYTE}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -max [get_ports {PAD_IRAM_PROG_ADDR_BYTE}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -max [get_ports {PAD_IRAM_PROG_ADDR_BYTE}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -min [get_ports {PAD_FETCH_EN}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -min [get_ports {PAD_FETCH_EN}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -max [get_ports {PAD_FETCH_EN}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -max [get_ports {PAD_FETCH_EN}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -min [get_ports {PAD_EXT_PERF_COUNTERS_9}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -min [get_ports {PAD_EXT_PERF_COUNTERS_9}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -max [get_ports {PAD_EXT_PERF_COUNTERS_9}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -max [get_ports {PAD_EXT_PERF_COUNTERS_9}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -min [get_ports {PAD_EXT_PERF_COUNTERS_8}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -min [get_ports {PAD_EXT_PERF_COUNTERS_8}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -max [get_ports {PAD_EXT_PERF_COUNTERS_8}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -max [get_ports {PAD_EXT_PERF_COUNTERS_8}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -min [get_ports {PAD_EXT_PERF_COUNTERS_7}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -min [get_ports {PAD_EXT_PERF_COUNTERS_7}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -max [get_ports {PAD_EXT_PERF_COUNTERS_7}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -max [get_ports {PAD_EXT_PERF_COUNTERS_7}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -min [get_ports {PAD_EXT_PERF_COUNTERS_6}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -min [get_ports {PAD_EXT_PERF_COUNTERS_6}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -max [get_ports {PAD_EXT_PERF_COUNTERS_6}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -max [get_ports {PAD_EXT_PERF_COUNTERS_6}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -min [get_ports {PAD_EXT_PERF_COUNTERS_5}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -min [get_ports {PAD_EXT_PERF_COUNTERS_5}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -max [get_ports {PAD_EXT_PERF_COUNTERS_5}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -max [get_ports {PAD_EXT_PERF_COUNTERS_5}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -min [get_ports {PAD_EXT_PERF_COUNTERS_4}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -min [get_ports {PAD_EXT_PERF_COUNTERS_4}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -max [get_ports {PAD_EXT_PERF_COUNTERS_4}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -max [get_ports {PAD_EXT_PERF_COUNTERS_4}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -min [get_ports {PAD_EXT_PERF_COUNTERS_3}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -min [get_ports {PAD_EXT_PERF_COUNTERS_3}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -max [get_ports {PAD_EXT_PERF_COUNTERS_3}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -max [get_ports {PAD_EXT_PERF_COUNTERS_3}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -min [get_ports {PAD_EXT_PERF_COUNTERS_2}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -min [get_ports {PAD_EXT_PERF_COUNTERS_2}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -max [get_ports {PAD_EXT_PERF_COUNTERS_2}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -max [get_ports {PAD_EXT_PERF_COUNTERS_2}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -min [get_ports {PAD_EXT_PERF_COUNTERS_15}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -min [get_ports {PAD_EXT_PERF_COUNTERS_15}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -max [get_ports {PAD_EXT_PERF_COUNTERS_15}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -max [get_ports {PAD_EXT_PERF_COUNTERS_15}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -min [get_ports {PAD_EXT_PERF_COUNTERS_14}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -min [get_ports {PAD_EXT_PERF_COUNTERS_14}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -max [get_ports {PAD_EXT_PERF_COUNTERS_14}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -max [get_ports {PAD_EXT_PERF_COUNTERS_14}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -min [get_ports {PAD_EXT_PERF_COUNTERS_13}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -min [get_ports {PAD_EXT_PERF_COUNTERS_13}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -max [get_ports {PAD_EXT_PERF_COUNTERS_13}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -max [get_ports {PAD_EXT_PERF_COUNTERS_13}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -min [get_ports {PAD_EXT_PERF_COUNTERS_12}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -min [get_ports {PAD_EXT_PERF_COUNTERS_12}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -max [get_ports {PAD_EXT_PERF_COUNTERS_12}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -max [get_ports {PAD_EXT_PERF_COUNTERS_12}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -min [get_ports {PAD_EXT_PERF_COUNTERS_11}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -min [get_ports {PAD_EXT_PERF_COUNTERS_11}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -max [get_ports {PAD_EXT_PERF_COUNTERS_11}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -max [get_ports {PAD_EXT_PERF_COUNTERS_11}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -min [get_ports {PAD_EXT_PERF_COUNTERS_10}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -min [get_ports {PAD_EXT_PERF_COUNTERS_10}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -max [get_ports {PAD_EXT_PERF_COUNTERS_10}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -max [get_ports {PAD_EXT_PERF_COUNTERS_10}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -min [get_ports {PAD_EXT_PERF_COUNTERS_1}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -min [get_ports {PAD_EXT_PERF_COUNTERS_1}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -max [get_ports {PAD_EXT_PERF_COUNTERS_1}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -max [get_ports {PAD_EXT_PERF_COUNTERS_1}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -min [get_ports {PAD_EXT_PERF_COUNTERS_0}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -min [get_ports {PAD_EXT_PERF_COUNTERS_0}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -max [get_ports {PAD_EXT_PERF_COUNTERS_0}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -max [get_ports {PAD_EXT_PERF_COUNTERS_0}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -min [get_ports {PAD_CLOCK_EN}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -min [get_ports {PAD_CLOCK_EN}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -max [get_ports {PAD_CLOCK_EN}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -max [get_ports {PAD_CLOCK_EN}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -min [get_ports {PAD_CLK}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -min [get_ports {PAD_CLK}]
set_driving_cell -lib_cell PDDW1216SCDG -rise -max [get_ports {PAD_CLK}]
set_driving_cell -lib_cell PDDW1216SCDG -fall -max [get_ports {PAD_CLK}]
set_case_analysis 0 [get_ports {PAD_TEST_EN}]
set_case_analysis 1 [get_ports {PAD_CLOCK_EN}]
set_max_fanout 20  [get_designs {lp_riscv_top}]
set_max_transition 0.35  [get_designs {lp_riscv_top}]
set_input_delay -add_delay 1.875 -clock [get_clocks {clk}] [get_ports {PAD_IRAM_PROG_BYTE_IDX_1}]
set_input_delay -add_delay 1.875 -clock [get_clocks {clk}] [get_ports {PAD_IRAM_PROG_ADDR_BYTE}]
set_input_delay -add_delay 1.875 -clock [get_clocks {clk}] [get_ports {PAD_EXT_PERF_COUNTERS_11}]
set_input_delay -add_delay 1.875 -clock [get_clocks {clk}] [get_ports {PAD_IRAM_PROG_BYTE_3}]
set_input_delay -add_delay 1.875 -clock [get_clocks {clk}] [get_ports {PAD_EXT_PERF_COUNTERS_5}]
set_input_delay -add_delay 1.875 -clock [get_clocks {clk}] [get_ports {PAD_EXT_PERF_COUNTERS_12}]
set_input_delay -add_delay 1.875 -clock [get_clocks {clk}] [get_ports {PAD_IRAM_PROG_BYTE_4}]
set_input_delay -add_delay 1.875 -clock [get_clocks {clk}] [get_ports {PAD_EXT_PERF_COUNTERS_6}]
set_input_delay -add_delay 1.875 -clock [get_clocks {clk}] [get_ports {PAD_CLOCK_EN}]
set_input_delay -add_delay 1.875 -clock [get_clocks {clk}] [get_ports {PAD_RST_N}]
set_input_delay -add_delay 1.875 -clock [get_clocks {clk}] [get_ports {PAD_IRAM_PROG_DATA_BYTE}]
set_input_delay -add_delay 1.875 -clock [get_clocks {clk}] [get_ports {PAD_EXT_PERF_COUNTERS_13}]
set_input_delay -add_delay 1.875 -clock [get_clocks {clk}] [get_ports {PAD_EXT_PERF_COUNTERS_0}]
set_input_delay -add_delay 1.875 -clock [get_clocks {clk}] [get_ports {PAD_IRAM_PROG_BYTE_5}]
set_input_delay -add_delay 1.875 -clock [get_clocks {clk}] [get_ports {PAD_EXT_PERF_COUNTERS_7}]
set_input_delay -add_delay 1.875 -clock [get_clocks {clk}] [get_ports {PAD_IRAM_PROG_WR}]
set_input_delay -add_delay 1.875 -clock [get_clocks {clk}] [get_ports {PAD_EXT_PERF_COUNTERS_14}]
set_input_delay -add_delay 1.875 -clock [get_clocks {clk}] [get_ports {PAD_EXT_PERF_COUNTERS_1}]
set_input_delay -add_delay 1.875 -clock [get_clocks {clk}] [get_ports {PAD_IRAM_PROG_BYTE_6}]
set_input_delay -add_delay 1.875 -clock [get_clocks {clk}] [get_ports {PAD_FETCH_EN}]
set_input_delay -add_delay 1.875 -clock [get_clocks {clk}] [get_ports {PAD_IRAM_PROG_BYTE_0}]
set_input_delay -add_delay 1.875 -clock [get_clocks {clk}] [get_ports {PAD_EXT_PERF_COUNTERS_8}]
set_input_delay -add_delay 1.875 -clock [get_clocks {clk}] [get_ports {PAD_EXT_PERF_COUNTERS_2}]
set_input_delay -add_delay 1.875 -clock [get_clocks {clk}] [get_ports {PAD_EXT_PERF_COUNTERS_15}]
set_input_delay -add_delay 1.875 -clock [get_clocks {clk}] [get_ports {PAD_IRAM_PROG_BYTE_7}]
set_input_delay -add_delay 1.875 -clock [get_clocks {clk}] [get_ports {PAD_TEST_EN}]
set_input_delay -add_delay 1.875 -clock [get_clocks {clk}] [get_ports {PAD_IRAM_PROG_BYTE_1}]
set_input_delay -add_delay 1.875 -clock [get_clocks {clk}] [get_ports {PAD_EXT_PERF_COUNTERS_9}]
set_input_delay -add_delay 1.875 -clock [get_clocks {clk}] [get_ports {PAD_EXT_PERF_COUNTERS_3}]
set_input_delay -add_delay 1.875 -clock [get_clocks {clk}] [get_ports {PAD_IRAM_PROG_BYTE_IDX_0}]
set_input_delay -add_delay 1.875 -clock [get_clocks {clk}] [get_ports {PAD_EXT_PERF_COUNTERS_10}]
set_input_delay -add_delay 1.875 -clock [get_clocks {clk}] [get_ports {PAD_IRAM_PROG_BYTE_2}]
set_input_delay -add_delay 1.875 -clock [get_clocks {clk}] [get_ports {PAD_EXT_PERF_COUNTERS_4}]
set_output_delay -add_delay 1.875 -clock [get_clocks {clk}] [get_ports {PAD_DONE_FLAG}]
set_clock_uncertainty 0.125 [get_clocks {clk}]
set_max_delay 7.5  -from [get_ports {PAD_TEST_EN PAD_RST_N PAD_IRAM_PROG_WR PAD_IRAM_PROG_DATA_BYTE PAD_IRAM_PROG_BYTE_IDX_1 PAD_IRAM_PROG_BYTE_IDX_0 PAD_IRAM_PROG_BYTE_7 PAD_IRAM_PROG_BYTE_6 PAD_IRAM_PROG_BYTE_5 PAD_IRAM_PROG_BYTE_4 PAD_IRAM_PROG_BYTE_3 PAD_IRAM_PROG_BYTE_2 PAD_IRAM_PROG_BYTE_1 PAD_IRAM_PROG_BYTE_0 PAD_IRAM_PROG_ADDR_BYTE PAD_FETCH_EN PAD_EXT_PERF_COUNTERS_9 PAD_EXT_PERF_COUNTERS_8 PAD_EXT_PERF_COUNTERS_7 PAD_EXT_PERF_COUNTERS_6 PAD_EXT_PERF_COUNTERS_5 PAD_EXT_PERF_COUNTERS_4 PAD_EXT_PERF_COUNTERS_3 PAD_EXT_PERF_COUNTERS_2 PAD_EXT_PERF_COUNTERS_15 PAD_EXT_PERF_COUNTERS_14 PAD_EXT_PERF_COUNTERS_13 PAD_EXT_PERF_COUNTERS_12 PAD_EXT_PERF_COUNTERS_11 PAD_EXT_PERF_COUNTERS_10 PAD_EXT_PERF_COUNTERS_1 PAD_EXT_PERF_COUNTERS_0 PAD_CLOCK_EN PAD_CLK}]  -to [get_ports {PAD_DONE_FLAG}] 
